#Область ПрограммныйИнтерфейс
Процедура ДополнитьФорму(Форма) Экспорт
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаЛево(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтакткоеЛицоНаФормуПередСуммаДокумекта(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтакткоеЛицоНаФормуПередСуммаДокумекта(Форма);
	КонецЕсли;  
	
КонецПроцедуры 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ211_КонтактноеЛицо";
КонецПроцедуры   

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаЛево(Форма)
	Если Форма.Элементы.Найти("ГруппаСкидка") = Неопределено Тогда 
		// Добавляем группу на форму
		ГруппаСкидка = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
		ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСкидка.ОтображатьЗаголовок = ЛОЖЬ; 
		//ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КонецЕсли;
	
	// Добавляем поле ввода
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда 
		ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка); 
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ДЗ211_СогласованнаяСкидка";
		ПолеВвода.УстановитьДействие("ПриИзменении", "ДЗ211_СогласованнаяСкидкаПриИзменении");
	КонецЕсли;

	// Добавляем команду
	Если Форма.Элементы.Найти("ПересчитатьТаблицу") = Неопределено Тогда 
		КомандаПересчитатьТаблицу = Форма.Команды.Добавить("ПересчитатьТаблицу");
		КомандаПересчитатьТаблицу.Заголовок = "Пересчитать таблицу";
		КомандаПересчитатьТаблицу.Действие = "КомандаПересчитатьТаблицу";
		
		КнопкаКоманды = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
		КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
		КнопкаКоманды.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КонецЕсли;
КонецПроцедуры

Процедура ВставитьПолеКонтакткоеЛицоНаФормуПередСуммаДокумекта(Форма)
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ211_КонтактноеЛицо";
КонецПроцедуры
#КонецОбласти